commands_templates/FindRecordings0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/search/wsdl" xmlns:sch="http://www.onvif.org/ver10/schema">
   <soap:Header/>
   <soap:Body>
      <wsdl:FindRecordings>
         <wsdl:Scope>
            <!--Zero or more repetitions:-->
            <sch:IncludedSources Type="http://www.onvif.org/ver10/schema/Receiver">
               <!--type: ReferenceToken-->
               <sch:Token>?</sch:Token>
               <!--You may enter ANY elements at this point-->
            </sch:IncludedSources>
            <!--Zero or more repetitions:-->
            <!--type: RecordingReference-->
            <sch:IncludedRecordings>?</sch:IncludedRecordings>
            <!--Optional:-->
            <!--type: XPathExpression-->
            <sch:RecordingInformationFilter>?</sch:RecordingInformationFilter>
            <!--Optional:-->
            <sch:Extension>
               <!--You may enter ANY elements at this point-->
            </sch:Extension>
         </wsdl:Scope>
         <!--Optional:-->
         <!--type: int-->
         <wsdl:MaxMatches>?</wsdl:MaxMatches>
         <!--type: duration-->
         <wsdl:KeepAliveTime>?</wsdl:KeepAliveTime>
      </wsdl:FindRecordings>
   </soap:Body>
</soap:Envelope>